{"data":{"https://www.ratemyprofessors.com/professor/284536":[["Has homework every day... Her vocab \"quizzes\" and tests are somewhat standard. You are expected to remember a lot of words, grammar rules, and sometimes culture related info, though. Probably would be much more stressful if you take her the beginning of sophomore year.","I knew 0 german coming in, but simply paying attention in class, following her work plan, and doing the homework got me an A pretty easily. She's a really fun professor if you choose to do well in class, and helps on tests/quizzes. She has funny German humor as well. If you are lazy, expect a bad time, but this is true for any class at Rose","She is a good teacher. She has weekly vocab quizzes and has great review packets for tests.","She's extremely helpful and willing to review material, especially if she went through it a bit quickly. The tests are not terrible, but they did require actually reading through the book. I had 3 years of German in high school and I still had a bit of studying to do. Overall, an awesome class.","I actually like attending her class, the grammar is hard although the vocab part is fun in my opinion. Her tests are definitely not easy, although I feel like i have learned a lot I did not know before. Also, I think she has a great sense of humor. Like srsly.","Crazy hard, most difficult class on the planet and it is only German I. At all costs, do not take this class or professor. It is the worst decision I ever made in my life.","Fill in the blanks are tricky because I have trouble finding what the English word would be to solve the 'riddle', let alone the German translation. The class overall is interesting, though teachers at Rose have generally been a lot more nitpicky with grammar. Class does move quickly though.","I do not recommend this teacher. She gives homework every night and expects you to remember over 700 vocab. over 1 quarter.","Very poor teacher. Rushes through the material and has inconsistent goals. Does not make the material relevant and does not communicate well with students. Avoid if you can.","She's horrible! i hated her class, even though the topic should have been interesting! She was very boring and expected everyone to know everything before she taught it! AVOID HER!","Okay, if you understand the English language (in other words, if you've had a foreign language before) you might be okay. You needn't have had German before, but it might help. This is a college language course, not a fluff class, so don't complain that there's a lot of work; if you don't want to learn the language, don't take the class.","She runs through all the material. Before you know whats going on you have a test or a quiz. She expects you to memorize everything and might only cover something once before she tests on it. AVOID!!!","I've had 3 years of german in HS & it went out the window in 111 & only got worse in 112. She FLYS though material- FLYS. On top of that, she expects that you have ALL THE TIME IN THE WORLD to study & MEMORIZE every ^%&(O&^ thing. Lets just say, thank god im out. I don't want a german minor anymore!","She's real tuff. Her clas moves way too fast. It's monday on a new chapter and thursday comes later that week and there's a quiz. You are still unclear what's goin on and BAM there's a quiz, then quiz you still don't kow what's goin on and there's a test. Don't take german unless you had it in HS","Horrible professor. Even when the whole class fails two tests and quizes in a row, she doesn't curve anything, or realize that she gave a hard test. She believes a quick little review of the test and yelling at students for not knowing it is good enough. I was going for a german minor now i'm not!!","She made learning German fun and exciting. I learned a lot too. Her quizzes and tests are sometimes difficult or tricky. Her lectures and class \"work\" enforce the material covered.","She is a good professor. The only complaint I have is that sometimes it isn't completely clear exactly what word she is looking for on the fill in the blank part on the tests and quizzes."]],"https://www.ratemyprofessors.com/professor/164380":[["Aside from the grammar that you learn, I didn't get much out of the class. He reuses the same exams from year to year pretty much. I did about 0.5 credit hours of work outside of the class. It's a breeze and a super easy class if you're decently good at Spanish. Make sure you do the homework because he WILL call on you.","The main thing I will say about this class - with the kind of content this course covered it could have been absolutely torturous with the wrong professor, and it absolutely wasn't. Gardner was incredibly invested in the subject which made the class pretty interesting, and while he wasn't the best lecturer the class was pretty easy. Recommend","The emphasis in the class is talking together. There are little assignments/readings to do daily (not hard at all). Tests were simple; they resemble activities in the book. He learned in Spain (talks with a ceceo / uses vosotros). I liked it but some may be confused. Most of us tested into the class and were at different levels; he handled it well.","Super kind person. Assigns quite a few textbook activities for HW which you go over in class. Do the HW since the exams are basically textbook exercises. Creates an environment where people can practice speaking & make mistakes. All main assessments are written. Usually speaks in Spanish but talks slowly & uses cognates to ensure you understand.","Dr. Gardner is a great professor. He cares about his students and his class greatly. Dr. Gardner grades overly nice so if you participate in class you'll most likely finish with an A.","Very good Spanish teacher. Assigns homework for the next day that is basically a clear preview for what will be discussed and done in class. He speaks with a bit of a different accent than what you're probably used to, but you'll pick up on it quick. Tests are basically glorified workbook activities, so do the workbook. Great, fun guy.","Fun guy, pretty easy to understand (though I'm sure it varies depending on your Spanish). He tends to dumb concepts down to make sure people understand him which is good. Tests are a BIT challenging, and its pretty hard to get an A on a composition, but the trick is participation. Got a B on every graded thing and an A in the class.","He was an okay prof. He spoke spanish all the time which was good, made learning easier, but he expected you to understand it all. Especially when he used obscure words in spanish, he wouldn't explain what they meant. The compositions were tough, though he did allow you to to turn in a rough draft for his revision. Tests were hard too.","This was his first year teaching Latin Amer. Lit. The discussion and presentations were fun but we needed more creative projects to do. I think in the future there will be fewer papers and more projects though. There is a lot of required reading for this class.","Classes go very quickly. He is very clear in his spanish, although he uses the vosotros form and that takes a little getting used to. Class itself is pretty easy, most stuff is completion based. The tests are a little hard.","The class periods generally just seem like a waste. Homework is rarely collected, and rarely mentioned in class. Most of the grade come from quizzes at the end of each period which can be graded way to harshly. Cool guy though, just not the best teaching style for me.","Decent Prof. He speaks in Spanish about 98% of the time, which really makes you pay attention and learn at the same time. The only thing is he is a pretty picky grader. Got a B- on our puppet show since our puppet's mouth wasn't constantly moving. Otherwise, not bad at all.","Awesome professor. He knows you don't come to Rose to take Spanish so he is leniant, while still doing a good job of teaching which is exactly what you want in a spanish professor. I feel like I learned well even though the class wasn't very hard.","Cool guy, doesn't expect you to speak good spanish at all, but expects you to try. I learned a lot, and had fun. Takes some effort to get an A though.","He knows you are not here to take Spanish so is leniant. He will not hound you if you didn't do your homework and is flexible. He is good to take and you learn something out of it. Only 10 minutes of homework a night + 3 one page papers and a speech.","Good prof, but he's kind of boring. Very nice guy though. I got the same grade as a friend who had a test average 20% less and the same grades on homework/quizzes/projects so I'm not sure about his grading. His dialect is from Spain, kind of confusing.","Very boring.","Fun teacher, went fast sometimes. you really have to pay attention but he isn't too bad.","Fun person, loves to chat in Spanish about anything the student wants to chat about.","Very enjoyable class. Lots of good discussion. Not afraid to let the students do the talking. Only weakness is toughness of grading.","Dr. Gardner is awesome! He's nice, funny, and a really good teacher.","Too much hw","Goofy looking Conan Obrian replica with a spitting spanish accent"]]}}